{
    "about": "Über uns",
    "about_blog": "BLOG",
    "about_blog_1": "Wenn Du gerne schreibst, denke Sie daran, dass <a href=':1:'> unser Blog</a> offen dafür ist von Dir erstellte Tutorials zu posten. Wenn Du Deinen eigenen Blog und etwas über Phalcon geschrieben hast, können wir das auch in unseren sozialen Netzwerk-Seiten veröffentlichen um maximale Sichtbarkeit zu erreichen. Wenn Dein Blog-Post in einer anderen Sprache als Englisch ist, wollen wir es teilen und möglicherweise, wenn möglich, übersetzen. Wenn Du Blogs rund um PHP kennst, welche daran interessiert sind das Projekt deren Publikum zu präsentieren, lasse es uns bitte wissen.",
    "about_description_1": "Großartige Projekte benötigen großartige Helfer. Wir mögen dich noch nicht kennen, aber wir wissen, dass du der Richtige bist. Gemeinsam können wir die Welt verändern! Hier bei Phalcon entwickeln wir die nächste Framework-Generation für PHP und wir möchten dir beeindruckende Geschwindigkeit bieten, während wir die Entwicklung zu einem einfachen und entspannten Erlebnis machen.",
    "about_description_2": "Wir hoffen, dass Du Phalcon genauso genießt, wie wir. Wir freuen uns immer über Deine Zusammenarbeit und Hilfe! <strong>Du musst kein C-Entwickler sein, um Phalcon zu unterstützen!</strong> Es gibt viele andere Bereiche, zu der Du beitragen kannst:",
    "about_documentation": "DOKUMENTATION",
    "about_documentation_1": "Das Repository dieser Website ist auf <a href=':1:'>github</a>verfügbar. Wir verwenden dieses Repository als Quelle für unsere Dokumentation nur für die englische Sprache!",
    "about_documentation_2": "Wir freuen uns immer über Korrekturen, Ergänzungen und Verbesserungen in unserer Dokumentation, so dass Sie nur das Projektarchiv klonen und eine Pull-Request!",
    "about_documentation_3": "Wenn Sie nicht-englisch sprechenden Entwicklern helfen können, indem Sie einige der Inhalte in eine andere Sprache übersetzen, wäre das großartig! Wir verwenden <a href=':2:'>:3:</a> </a> für unsere Übersetzungen, und Sie finden unser Projekt <a href=':4:'>hier</a>",
    "about_donations_sponsoring": "DONATIONS / SPONSORING",
    "about_evangelism": "EVANGELISMUS",
    "about_evangelism_1": "Es gibt eine Menge Leute, die noch nicht wissen, dass es Phalcon gibt oder dass es wirklich funktioniert. Wir sind sicher, dass viele Entwickler davon profitieren, wenn sie hören, was Phalcon alles kann und wie sie es unterstützen können. Wenn Du eine PHP-Veranstaltung oder ein Treffen kennst und gerne einen Vortrag über das Projekt halten möchtest, hast Du unsere volle Unterstützung. Wer möchte nicht das Tool kennen, dass die PHP-Entwicklung revolutioniert?",
    "about_facebook_page": "Facebook-Seite",
    "about_flying_with_phalcon": "Thanks for flying with Phalcon! &lt;3",
    "about_follow_on_gab": "Folge uns bei Gab",
    "about_follow_on_twitter": "Folge uns bei Twitter",
    "about_official_blog": "Offizieller Blog",
    "about_sample_applications": "BEISPIEL-ANWENDUNGEN",
    "about_sample_apps_1": "Umfangreiche Beispiele helfen beim Verständnis der vielen Möglichkeiten des Phalcon-Frameworks. Teile Deine Repositories, denn Beispielanwendungen helfen anderen bei Ihrer Arbeit und unterstützen Dich zudem mit Feedback über Deine eigene Arbeit!",
    "about_screencasts": "SCREENCASTS",
    "about_screencasts_1": "Wir alle lieben Screencasts. Wenn du etwas mehr Zeit hast und die Community mit ein paar schönen Videos unterstützen möchtest, die die Funktionen des Frameworks belegen, ist es sehr willkommen. Schauen Sie sich unseren <a href=':1:'>YouTube-Kanal</a> als Anleitung an.",
    "about_share_experiences_1": "Sei nicht schüchtern, Deine Erfahrungen mit Phalcon oder einzelnen Komponenten zu teilen. Obwohl nicht alle Anfragen sofort implementiert werden können, hilft uns Dein Feedback bei der Entwicklung von neuen Funktionen, welche die Entwicklung des Projekts prägen können.",
    "about_share_your_experiences": "TEILE DEINE ERFAHRUNGEN",
    "about_social_networks": "SOZIALE NETZWERKE",
    "about_social_networks_1": "Phalcon entwickelt sich durch unsere Verbesserungswünsche täglich weiter. Soziale Netzwerke sind Teil unseres heutigen Lebens und jeder interagiert mit anderen durch diese. Teile Deine Phalcon-Erlebnisse mit Deinen sozialen Kreisen und verbreite das Projekt. Zunehmend mehr Menschen beteiligen sich an unserer Gemeinschaft und machen sie dadurch kraftvoller, facettenreicher und populärer. Like, '+1' oder teile Beiträge, welche wir regelmäßig durch verschiedenen sozialen Netzwerke verbreiten. Die Leute, welche Phalcon durch Dich entdecken, werden es Dir danken!",
    "about_social_networks_2": "Wir sind in den populäreren sozialen Netzwerken vertreten. Wenn Du uns folgst, hilfst Du uns dabei, die Verbreitung und Sichtbarkeit des Projektes zu erhöhen.",
    "about_sponsoring_1": "Wir sind ein kleines aber effektives Entwicklerteam. Wir versuchen, so viel Zeit wie möglich mit dem Projekt zu verbringen. Unsere Leidenschaft für das Projekt verbessert dieses permanent. Phalcon ist Open-Source-Software und freiwillige Beiträge sind für die weitere Entwicklung erforderlich. Sie können die Entwicklung aktiv durch Spenden an das Projekt oder Entwickler unterstützen. Mehr Zeit und Ressourcen für das Projekt bedeutet mehr Aktivität, mehr Verbesserung, mehr Untersützung und mehr nützliche Features.",
    "about_star_on_github": "Sterne das Projekt auf Github",
    "about_tests": "TESTS",
    "about_tests_1": "Keine Software ist frei von Fehlern. Wenn Du welche findest, zögere bitte nicht, es uns zu mitzuteilen. Wir haben eine Testsuite mit mehr als <a href=':1:'>16.000</a> Tests. Unit-Tests sind jedoch nie genug. Hilf uns unsere Testsuite zu verbessern, indem mehr Tests oder die jetzigen verbessern werden. Alle hinzugefügten Tests machen das Framework stabiler.",
    "about_thank_you": "DANKE!",
    "about_thank_you_1": "Wir danken allen Helfern und Mitgliedern der Gemeinschaft, welche Phalcon zum besten Framework seiner Art machen. Euer Engagement motiviert uns jeden Tag. Wir danken für euer Vertrauen in Phalcon.",
    "about_translations": "ÜBERSETZUNGEN",
    "about_translations_1": "Wir versuchen, möglichst viele Entwickler durch Abbau von Sprachbarrieren zu erreichen. Wir verwenden <a href=':1:'>:2:</a>, um die Wörter oder Sätze zu behandeln, die für diese Website übersetzt werden müssen. Die Projekt-Repository befindet sich <a href=':3:'> hier</a>.",
    "acl": "ACL",
    "acl_1": "So kannst Du die Access Control Liste (ACL) erstellen:",
    "acl_2": "Erstellen der ACL",
    "acl_3": "The default action is DENY access",
    "acl_4": "Registriere zwei Rollen, Benutzer",
    "acl_5": "und Gäste",
    "acl_description": "Access Control List ermöglicht Benutzern den Zugriff auf Module, zu denen Sie berechtigt sind",
    "auto_loader": "Autoloader",
    "auto_loader_1": "Registeren Sie Namespaces, Präfixe, Verzeichnisse oder Klassen. Profitieren Sie von den Autoloader Ereignissen und erhalten Sie volle Kontrolle darüber welche Dateien geladen werden und von wo.",
    "auto_loader_2": "Erstellt den Autoloader",
    "auto_loader_3": "Einige Namespaces registrieren",
    "auto_loader_4": "Autoloader registrieren",
    "autoloader": "Autoloader",
    "autoloader_description": "Stellt den autoloading Mechanismus von PHP-Klassen gemäß PSR-4 zur Verfügung.",
    "basic_features": "Basic Features",
    "blog": "Blog",
    "built_with_phalcon": "Built with Phalcon",
    "cache": "Cache",
    "cache_1": "Die Cache-Komponente ermöglicht schnelleren Zugriff auf häufig verwendete oder bereits verarbeitete Daten. Es unterstützt viele Backends wie Redis, Memcached, Mongo, Dateien, Apc und mehr",
    "cache_2": "Legt den Cache für Modelle fest",
    "cache_3": "Cachet Daten für einen Tag in der Standardeinstellung",
    "cache_4": "Memcached-Verbindungseinstellungen",
    "cache_description": "Verbessere die Leistung mit vielen Back-End-Caches, welche Phalcon bietet",
    "community": "Community",
    "contribute": "Mitwirken",
    "contributors": "Phalcon Mitwirkende",
    "contributors_description": "Phalcon wird täglich durch unsere fantastische Community verbessert",
    "consulting": "Beratung",
    "consulting_mctekk_1": "MCTekK sprang auf dem Phalcon Zug seit dem ersten Tag. Von seiner Konzeption sahen wir die großen Vorteile, die Phalcon bot und in der Zukunft bieten könnte.",
    "consulting_mctekk_2": "Wir haben reichlich Erfahrung mit Phalcon und haben eine Vielzahl von Projekten damit als Kern entwickelt. Wir stehen für Sie bereit, um in allen Dingen zu beraten, was Sie bezüglich Phalcon benötigen, um Ihre Fertigstellung, Schnelligkeit und Qualität zu verbessern.",
    "consulting_mctekk_3": "Kontaktieren Sie uns über unsere <a href=':1:'> Webseite</a>, wo Sie einen Blick auf die Projekte nehmen können, an denen wir beteiligt waren.",
    "consulting_mctekk_header": "MCTekK hat bereits verschiedene high-End Phalcon Projekte ausgeliefert, durch ihren wichtigsten Stärken, Web und mobile Entwicklung.",
    "crypt": "Crypt",
    "crypt_description": "Encrypte/Decrypte wichtige Daten um sie sicher vor Zugriffen Dritter zu machen",
    "data_and_storage": "Data & storage",
    "dependency_injection": "Dependency Injection",
    "dependency_injection_1": "Phalcon baut auf einer leistungsstarken und dennoch einfach zu verstehenden und nutzbaren Dependency Injection auf. Initialisieren oder definieren Sie Services einmal - und verwenden sie praktisch überall in der gesamten Anwendung.",
    "dependency_injection_2": "Create the Dependency Injector Container",
    "dependency_injection_3": "Registrieren Sie, Klassen, Funktionen, Komponenten",
    "dependency_injection_4": "Überall sonst im Code verwenden",
    "dependency_injection_description": "Dependency Injection und Lage der Dienste und es ist selbst ein Container für sie.",
    "development": "Entwicklung durch",
    "docs": "Dokumentation",
    "documentation": "Dokumentation",
    "donate": "Spenden",
    "download": "Download",
    "download_arch": "Arch Linux",
    "download_arch_1": "Für ArchLinux ist ein <a href=':1:'>PKGBUILD</a> verfügbar.",
    "download_compilation": "Kompilieren",
    "download_compilation_1": "Auf Linux kannst Du die Erweiterung mithilfe des Quellcodes kompilieren und installieren.",
    "download_compilation_11": "1. Um die Erweiterung zu kompilieren sind folgende Schritte erforderlich:",
    "download_compilation_12": "2. Füge die Erweiterung zur php.ini hinzu:",
    "download_compilation_13": "3. Zum Schluss noch den Webserver neu starten",
    "download_cpanel": "cPanel",
    "download_cpanel_1": "Nach Anfragen aus der Community haben die cPanel-Entwickler ein benutzerdefiniertes Modul veröffentlicht, das die Installation von Phalcon in cPanel gehosteten Websites ermöglicht. Informationen finden Sie <a href=':1:'> hier</a>. Das Modul wird in <a href=':2:'> Github</a> gepflegt.",
    "download_dependencies": "Abhängigkeiten",
    "download_dependencies_1": "Obwohl Phalcon nicht direkt auf andere PHP-Erweiterungen zugreift, nutzt es einige um die Funktionalität zu erweitern. Die genutzten Erweiterungen sind:",
    "download_dependencies_2": "Es ist nicht notwendig dass die oben genannten Erweiterungen im System vorhanden sind, wo Phalcon installiert ist. Du brauchst nur solche installieren, welche Deinen Bedürfnissen entsprechen. Wenn Du zum Beispiel eine MySQL-Datenbank nutzt, dann brauchst Du nur PDO und PDO/MySQL Oracle laden und stattdessen SQlite, Postgresql und Mongo ignorieren.",
    "download_developer_tools": "Entwicklungswerkzeuge",
    "download_devtools_1": "Diese Anwendungssammlung enthält nützliche Skripte, um ein Codegerüst zu generieren. Kernkomponenten Deiner Anwendung können mit einem einfachen Befehl erstellt werden - dies ermöglicht die einfache Entwicklung von Anwendungen mit Phalcon.",
    "download_devtools_composer": "Installation via Composer",
    "download_devtools_composer_1": "Installiere Composer in einem beliebigen Verzeichnis:",
    "download_devtools_composer_2": "composer.json wie folgt erstellen:",
    "download_devtools_composer_3": "Führe den Composer-Installer aus:",
    "download_devtools_composer_4": "Erstelle eine Verknüpfung zum phalcon.php-Skript:",
    "download_devtools_docs": "Dokumentation: <a href=':1:'>Phalcon Entwicklerwerkzeuge</a>",
    "download_devtools_download": "Du kannst ein Cross-Plattform-Paket mit den Entwicklertools von <a href=':1:'> Github</a> herunterladen oder Klonen.",
    "download_examples": "Vorinstallierte Beispiele",
    "download_examples_1": "Die folgenden Beispiele sind auf allen Vagrant-Containern vorinstalliert:",
    "download_freebsd": "FreeBSD",
    "download_freebsd_1": "Eine Version für FreeBSD ist vorhanden. Du musst lediglich die folgenden Befehle ausführen um sie zu installieren:",
    "download_ide_stubs": "IDE stubs",
    "download_ide_stubs_1": "Das Video unten beschreibt, wie IDE Stubs für PhpStorm aktiviert werden",
    "download_linux": "Linux/Unix/Mac",
    "download_need_help": "Brauchen Sie Hilfe?",
    "download_need_help_1": "Schauen Sie auf unserer <a href=':1:'> Support-Seite</a> nach Möglichkeiten, Unterstützung zu erhalten. Wir tun unser Bestes, um Ihnen zu helfen.",
    "download_note": "Phalcon ist eine in C geschriebene Erweiterung, daher musst Du die passende Binary herunterladen oder neu kompilieren.",
    "download_opensuse": "OpenSUSE",
    "download_opensuse_1": "Ein Paket ist <a href=':1:'> hier</a> verfügbar (Dank an <a href=':2:'> Mariusz Łączak</a>)",
    "download_requirements": "Systemanforderungen",
    "download_requirements_1": "Es werden einige vorinstallierte Softwarepakete benötigt:",
    "download_requirements_2": "PHP 5.x development resources",
    "download_requirements_3": "GCC-Compiler",
    "download_psr": "The <a href=':1:'>PSR</a> extension is required to be loaded before Phalcon. Please ensure that it is available in your system",
    "download_source_code": "Source Code:  <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
    "download_source_code_switch": "Source Code (please switch to the relevant branch): <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
    "download_ubuntu": "Um Phalcon unter Ubuntu zu installieren folge diesen Schritten:",
    "download_pecl": "PECL",
    "download_pecl_1": "Mit Pecl wird diese Erweiterung automatisch in Ihrem System installiert",
    "download_pecl_2": "Die Pecl Installationsmethode ist für Windows, Linux und MacOS verfügbar. Unter Linux und MacOS wird phalcon lokal kompiliert, so dass es schneller sein könnte, eine andere Installationsmethode auf diesen Plattformen zu verwenden. Um mit Pecl zu installieren, stellen Sie sicher, dass <a href=':1:'>pecl/pear</a> installiert ist.",
    "download_ubuntu_1": "Wenn dir apt-add-repository fehlt führe folgendes aus:",
    "download_ubuntu_2": "Wenn Sie die ältere Version von Phalcon (1.x) installieren möchten, verwenden Sie die folgende PPA: ",
    "download_ubuntu_or_debian": "Ubuntu oder Debian",
    "download_windows": "Windows-DLLs",
    "download_windows_download": "Download",
    "download_windows_dlls": "Windows-DLLs können von unserer Github Release Seite <a href=':1:'> hier</a> heruntergeladen werden",
    "download_windows_guides": "Ähnliche Anleitungen",
    "download_windows_guides_wamp": "WAMP Installation",
    "download_windows_guides_xampp": "XAMPP Installation",
    "download_windows_installation": "Installation",
    "download_windows_installation_1": "Um Phalcon unter Windows zu verwenden, können Sie eine DLL-Bibliothek herunterladen. Bearbeiten Sie Ihre php.ini, fügen Sie am Ende hinzu und starten Sie Ihren Webserver um die Erweiterung zu laden. <a href=':1:'>Mehr</a>.",
    "download_windows_note": "Wir empfehlen Ihnen dringendst die letztmögliche PHP-Version passend zu unseren DLLs zu nutzen, da Sie nur auf diesem Weg den vollen Funktionsumfang von Phalcon nutzen können.",
    "dropdown_menu_title_social": "Sozial",
    "dropdown_menu_title_help": "Hilfe",
    "encryption": "Verschlüsselung",
    "encryption_1": "Phalcon provides encryption facilities via the Phalcon\\Crypt component. This class offers simple object-oriented wrappers to the openssl PHP's encryption library.",
    "encryption_2": "This is a secret key (32 bytes).",
    "encryption_3": "The text you want to encrypt.",
    "events": "Ereignisse",
    "events_description": "Extend the most of the framework components by setting 'hook points'. Create your own events and make your application more flexible and powerful",
    "events_management": "Events Management",
    "events_management_1": "An EventsManager allows us to attach listeners to a particular type of event. The type that interests us now is 'dispatch'. The following code filters all events produced by the Dispatcher:",
    "events_management_2": "Create an events manager",
    "events_management_3": "Listen for events produced in the",
    "events_management_6": "dispatcher using the SecurityPlugin",
    "events_management_4": "Handle exceptions and not-found",
    "events_management_7": "exceptions using NotFoundPlugin",
    "events_management_5": "Assign the events manager",
    "events_management_8": "to the dispatcher",
    "features": "Features",
    "flash_messages": "Flash messages",
    "flash_messages_1": "Use the flash notifier to show notifications to a user in a web application:",
    "flash_messages_2": "there were errors in this form",
    "flash_messages_3": "yes!, everything is fine",
    "flash_messages_4": "this is a notice for users",
    "flash_messages_5": "this is just a warning",
    "flash_messages_description": "Flash messages are used to notify the user about the state of actions.",
    "forms_builder": "Forms Builder",
    "forms_builder_1": "Each element in the form can be rendered as required by the developer. Internally, Phalcon\\Tag is used to produce the correct HTML for each element and you can pass additional HTML attributes as the second parameter of render():",
    "forms_builder_2": "Home",
    "forms_builder_3": "Mobiltelefon",
    "forms_builder_description": "Easily create HTML forms",
    "forum": "Forum",
    "get_phalcon": "Get Phalcon",
    "header_slogan": "Its innovative architecture makes Phalcon the fastest PHP framework ever built!",
    "header_tagline": "A full-stack PHP framework delivered as a C-extension",
    "header_description": "Developers do not need to know C to use Phalcon. Its functionality is exposed as PHP classes and interfaces under the Phalcon namespace, ready to be used.",
    "help": "Hilfe",
    "high_performance_php_framework": "High Performance PHP Framework",
    "hosting": "Hosting",
    "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud delivers scalable, pay-as-you-go compute capacity in the cloud.",
    "hosting_amazon_ec2_2": "Select a pre-configured, templated Amazon Machine Image (AMI) to get up and running immediately. Or create an AMI containing your applications, libraries, data, and associated configuration settings. <a href=':1:'>See more</a>",
    "hosting_amazon_ec2_title": "Amazon EC2",
    "hosting_aspnix_1": "ASPnix provides superior Linux cPanel and Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
    "hosting_aspnix_2": "Phalcon is supported on all Windows and Linux cPanel shared web hosting packages and plans, no configuration or installation required! ASPnix offers a variety of PHP versions from 5.2 - 7.2 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
    "hosting_aspnix_title": "ASPnix",
    "hosting_azure_1": "The <a href=':1:'>Windows Azure cloud</a> provides you with highly scalable and manageable Windows hosting for your web apps. Use Phalcon to reduce your instance costs.",
    "hosting_azure_2": "To install Phalcon, follow the step by step procedure in <a href=':1:'>this SitePoint article</a>.",
    "hosting_azure_title": "Windows Azure",
    "hosting_description": "Phalcon can be installed on any machine on which the hosting provider offers SSH root access (or sudo). Below is a list of reputable companies that offer such services: ",
    "hosting_digital_ocean_1": "Blazing Fast Cloud Technology. Built for developers. Deploy an SSD cloud server in 55 seconds. <a href=':1:'>See more</a>",
    "hosting_digital_ocean_2": "Follow this <a href=':1:'>tutorial</a> to get started",
    "hosting_digital_ocean_title": "Digital Ocean",
    "hosting_fortrabbit_1": "Fortrabbit offers many hosting plans (there is one for developers and is free - with some limitations) that would satisfy the needs of most of the developers that wish to either try Phalcon or deploy their applications using it.",
    "hosting_fortrabbit_2": "They offer a variety of <a href=':1:'>extensions</a> that would satisfy even the most demanding project.",
    "hosting_fortrabbit_3": "Stable versions of Phalcon are pre-installed, you can activate them from the administration dashboard.",
    "hosting_fortrabbit_title": "Fortrabbit",
    "hosting_install_instructions": "Install Phalcon using the standard instructions of installation.",
    "hosting_kinghost_1": "Since 2006, KingHost is one of the largest hosting company sites in Brazil and already has over 300,000 sites hosted with approximately 60,000 customers. Headquartered in Porto Alegre (RS) , with data centers in Brazil , the company offers the hosting service of shared servers, specific plans for custom developers and projects in the area of enterprise solutions , including cloud computing and dedicated servers. It also offers digital marketing solutions such as email marketing and security solutions.",
    "hosting_kinghost_title": "KingHost",
    "hosting_layershift_1": "Next generation, auto-sizing PaaS for Java, PHP, Ruby, Python, and Node.js apps. Fully isolated self-scaling role-based containers for each customer, including choice of Apache or Nginx, and full range of SQL and NoSQL servers. Pay for resource usage, not server instance size. SSD-powered. UK hosted.",
    "hosting_layershift_2": "Follow this <a href=':1:'>tutorial</a> to get started",
    "hosting_layershift_title": "Layershift",
    "hosting_linode_1": "Deploy and Manage Linux Virtual Servers in the Linode Cloud. Get a server running in seconds with your choice of Linux distro, resources, and node location. <a href=':1:'>See more</a>",
    "hosting_linode_title": "Linode",
    "hosting_mediasecure_1": "High performance Dedicated Servers with protection against threats including Distributed Denial of Service (DDoS) attacks. Our high-capacity DDoS-Protected network can automatically protect your dedicated server from DDoS attacks up to 4.2 Tbps. <a href=':1:'>See more</a>",
    "hosting_mediasecure_title": "Mediasecure",
    "hosting_rackspace_1": "Cloud Servers are virtual machines running Linux or Windows&reg; Server in the Rackspace Cloud. You can scale resources like CPU, memory, and storage up or down, depending on your needs. Best of all, you can pay as you go. <a href=':1:'>See more</a>",
    "hosting_rackspace_title": "Rackspace",
    "hosting_webfaction_1": "WebFaction Hosting for developers. Full shell access to fast servers with all your favorite tools pre-installed and maintained for the user.",
    "hosting_webfaction_2": "To install Phalcon in WebFaction, follow the instructions outlined <a href=':1:'>here</a>",
    "hosting_webfaction_title": "WebFaction",
    "i18n": "i18n",
    "i18n_1": "The component Phalcon\\Translate aids in creating multilingual applications. Applications using this component, display content in different languages, based on the user's chosen language supported by the application.",
    "i18n_2": "Browser's best language",
    "i18n_3": "Check the lang translation file",
    "i18n_4": "Fallback to some default",
    "i18n_5": "Return a translation object",
    "i18n_description": "Translate your applications to many languages easily",
    "installing_phalcon_php": "Installing Phalcon PHP",
    "issue_tracker": "Issue Tracker",
    "join_our_community": "Come join our vibrant developer community!",
    "join_our_community_description": "Community contributions in Extensions, Plugins, Adapters, VM, examples, source code... and more",
    "language_text": "Deutsch",
    "learn": "Lernen",
    "license_new_bsd": "Phalcon is an open-source PHP framework <br />built as a C-extension. It is available under the <br /><a href='http://opensource.org/licenses/BSD-3-Clause' target='_blank'>new BSD License</a>.",
    "low_overhead": "Low overhead",
    "low_overhead_1": "Zephir/C extensions are loaded together with PHP one time on the web server's daemon start process",
    "low_overhead_2": "Classes and functions provided by the extension are ready to use for any application",
    "low_overhead_3": "The code is compiled and isn't interpreted because it's already compiled to a specific platform and processor",
    "low_overhead_4": "Thanks to its low-level architecture and optimizations <strong>Phalcon provides the lowest overhead for MVC-based applications</strong>",
    "low_overhead_description": "Low memory consumption and CPU compared to traditional frameworks",
    "low_overhead_title": "PHP C-extension (Phalcon)",
    "more": "MEHR...",
    "mvc": "MVC",
    "mvc_1": "Build single and multi-module applications with ease and pleasure. Using the file structure, scheme and patterns you already know.",
    "mvc_hmvc": "MVC & HMVC",
    "mvc_hmvc_description": "Modules, components, models, views and controllers",
    "odm_for_mongo": "ODM for MongoDB",
    "odm_for_mongo_1": "In addition to its ability to map tables in relational databases, Phalcon can map documents to a MongoDB database. The ODM offers a CRUD functionality, events, validations among other services.",
    "odm_for_mongo_2": "How many robots are there?",
    "odm_for_mongo_3": "How many mechanical robots are there?",
    "odm_for_mongo_4": "There are count($robots) robots",
    "odm_for_mongo_description": "Object Document Mapping for MongoDB",
    "or": "oder",
    "orm": "ORM",
    "orm_1": "A powerful ORM is provided by Phalcon allowing you to manipulate database records as classes and objects. MySQL, PostgreSQL and SQLite are supported out of the box.",
    "orm_description": "Object Relational Mapping",
    "phalcon_team": "Das Phalcon-Team",
    "phalcon_team_1": "Many more people",
    "phalcon_team_2": "Phalcon is and has always been an effort of many volunteers: ",
    "phql": "PHQL",
    "phql_1": "PHQL is a high-level, object-oriented SQL dialect that allows to write queries using a standardized SQL-like language. PHQL is implemented as a parser (written in C) that translates syntax in that of the target RDBMS. To achieve the highest performance possible, Phalcon provides a parser that uses the same technology as SQLite. This technology provides a small in-memory parser with a very low memory footprint that is also thread-safe.",
    "phql_2": "Name",
    "phql_description": "The powerful and secure Phalcon Query Language, PHQL",
    "polling_app": "A polling app built from scratch in &lt; 15 min",
    "queueing": "Queueing - background process",
    "queueing_1": "Activities like processing videos, resizing images or sending emails aren't suitable to be executed online or in real time because it may slow the loading time of pages and severely impact the user experience. The best solution here is to implement background jobs. The web application puts jobs into a queue and which will be processed separately.",
    "queueing_2": "Connect to the queue",
    "queueing_3": "Insert the job in the queue",
    "queueing_description": "Use the built-in queueing system in Phalcon to schedule jobs and reduce the load of your web server",
    "rest": "Rest",
    "rest_description": "In this case, you can use either a micro or full stack application to meet your goal. In addition, a powerful set of HTTP helpers.",
    "restful_services": "Restful Services",
    "restful_services_1": "Writing REST servers and applications has never been easier. No boilerplate. Simple services will fit in one file.",
    "restful_services_2": "Returning data in JSON",
    "router": "Router",
    "router_1": "Routing as it supposed to be. Nothing more. Nothing less.",
    "router_2": "Create the router",
    "router_3": "Define a route",
    "router_description": "Phalcon\\Mvc\\Router provides advanced routing capabilities.",
    "see_for_yourself": "See for yourself...",
    "search": "Suche...",
    "sharding": "Sharding",
    "sharding_1": "Attach models to different databases",
    "sharding_2": "This service returns a MySQL database",
    "sharding_3": "This service returns a PostgreSQL database",
    "sharding_description": "Connect, store and retrieve data from many database systems at the same time",
    "site": "Seite",
    "social": "Sozial",
    "sponsored_by": "Gesponsert von",
    "sponsors": "Sponsoren",
    "sponsors_and_supporters": "Sponsoren und Förderer",
    "sponsors_and_supporters_upper": "SPONSOREN UND FÖRDERER",
    "sponsors_become_patron": "Become a Patron!",
    "sponsors_description_1": "For those that wish to sponsor our work and further the development of Phalcon, we offer various sponsorship options that will fit any budget. Sponsoring our work allows us to devote more time to the project, offer faster responses to bugs and features and ensure the projects's stability.",
    "sponsors_our_great_sponsors": "These are our sponsors! Thank you!!",
    "store": "Store",
    "support": "Support",
    "support_discord": "Come join the Phalcon <a href=':1:'>Discord</a>",
    "support_documentation_1": "Please use the <a href=':1:'>documentation</a> before anything else. You can also use the search feature in our documents to find what you are looking for. If your question is still not answered, there are more options below.",
    "support_download_page": "download page",
    "support_note_1": "Our great community and contributors are happy to help you though! Please use these community resources for obtaining help.",
    "support_note_2": "Many bugs are raised because users are not running the latest version. Please visit the <a href=':1:'>download page</a>, download the latest available version (or compile it) and confirm if the issue you are experiencing is indeed a bug.",
    "support_phalcon_forum": "Questions should go to <a href=':1:'>Official Forums</a>",
    "support_please_note": "Bitte beachte:",
    "support_please_note_1": "Stack Overflow is not dedicated to support Phalcon",
    "support_please_note_2": "Please do not raise new bugs there. Please use the <a href=':1:'>issue tracker</a> in Github for that",
    "support_please_note_3": "Please do not ask for feature requests there. Please use the <a href=':1:'>issue tracker</a> in Github for that",
    "support_please_note_4": "Make sure you include the 'phalcon' tag with your question",
    "support_please_note_5": "Make sure you mention 'Phalcon' in the question",
    "support_reporting_a_bug": "Reporting a bug",
    "support_reporting_a_bug_0": "If you still believe that what you found is a bug, please <a href=':1:'>open an issue</a>",
    "support_reporting_a_bug_1": "Please report bugs when you've exhausted all of the above options, using the <a href=':1:'>issue tracker</a> in Github.",
    "support_stack_overflow": "Another way is to ask a question on <a href=':1:' target='_blank'>Stack Overflow</a> and tag it with <a href=':2:'><code>phalcon</code></a>",
    "support_social_network_accounts": "Our social network accounts are:",
    "support_us": "Support Us",
    "team": "Team",
    "team_andres_1": "Andres ist kein Open-Source-Neuling. In den letzten neun Jahren hat er verschiedene Frameworks für PHP entwickelt und veröffentlicht. Zudem ist er mit der Entwicklung von Webanwendungen vertraut - seiner Hauptleidenschaft.",
    "team_andres_2": "Als TR35-Gewinner versucht Andres mit der richtigen Wahl und Implementation oder dem richtigen Werkzeug einen Auftrag mit Fokus auf Durchsatz auszuführen. Um dies zu erreichen entwickelte er 2011 die Idee eine neue Art von Framework für PHP-Entwickler zu entwerfen, welches auf Benutzerfreundlichkeit, Funktionsreichtum und insbesondere Geschwindigkeit ausgelegt ist.",
    "team_andres_3": "Durch diesen neuen innovativen Ansatz wurde Phalcon geboren. Ein PHP-Framework, in C geschrieben, welches zahlreiche Funktionen für Entwickler bietet und trotzdem maximale Geschwindigkeit und minimalen Ressourcenverbrauch vereint.",
    "team_andres_4": "Andres war die Inspiration hinter Phalcon und obwohl er nicht mehr mit dem Projekt ist, wären wir immer dankbar für seine Vision.",
    "team_anton_1": "Anton entdeckte Phalcon 2013 und verliebte sich sofort. Er begann mit der Erstellung persönlicher Projekte und Anwendungen mittels v1.2 und hat sie bis jetzt weiter verwendet, bei Bedarf aktualisiert. Seine Vision ist es, Phalcon zu einem schnellen, wettbewerbsfähigen, voll funktionsfähigen und robusten Framework zu machen, das Entwicklern in dieser dynamischen Web-Welt helfen kann.",
    "team_anton_2": "Er begann zunächst mit kleinen Beiträgen zum Projekt beizutragen, aber in letzter Zeit hat er bei der Unterstützung und Wartung mehrerer Projektarchive und Nebenprojekte geholfen.",
    "team_anton_3": "Anton konzentriert sich derzeit auf DevTools, Migrationen, Dokumentation sowie Docker Bilder für Phalcon.",
    "team_nikos_1": "Nikos ist seit über 20 Jahren in der IT-Industrie. Er wurde im Jahr 2000 in die PHP-Welt eingeführt und setzt sie seitdem sowohl in persönlichen Projekten als auch in Projekten für seine Arbeitgeber ein.",
    "team_nikos_2": "Er liebt es, neue Technologien und Wege zu entdecken, welche eine Integration mit bestehenden Anwendungen ermöglichen. Dies führt zur Maximierung von Vorteilen sämtlicher beteiligten Projekte.",
    "team_nikos_3": "Er ist ein begeisterter Unterstützer von Test Driven Development (TDD) und versucht immer, seinen Programmcode vollständig abzudecken.",
    "team_nikos_4": "Nikos bestehendes Interesse an neuen und innovativen Technologien abseits der bestehenden Wege führte ihn zu Phalcon. Er trat dem Kernteam bei und seine Aufgaben betreffen vor allem die Koordinierung von NFRs, Fehlerberichten, Hilfe mit Tests, Dokumentation und dem Incubator. Nikos ist zudem für die Bereitstellung der Windows DLLs des Projektes zuständig und bietet - wann immer dies möglich ist - Hilfe und Support.",
    "team_paul_1": "Paul considers himself very lucky to have spent the last decade of his life writing user-friendly software with the help of open source frameworks and tools like Phalcon. As a result, he spends his off-work hours trying to improve FOSS tools and the lives of other developers like himself. He has a strong need for simple code and self-evident UX, with Phalcon he focuses on documentation, new user experience, contributor relations, and community outreach.",
    "team_paul_2": "Paul recently started his own company to follow his passion of building intuitive software with emerging technologies like, ReactJS, Webpack, Ruby, and Elixir(Erlang). He now proudly adds Zephir and Phalcon to that ever growing list and is happy to take on the role of cheerleader, advocating their innovative features.",
    "team_paul_3": "On the chance he isn't coding, Paul is following in his wife's footsteps and developing his interest in videography and video production. He operates an educational YouTube channel currently focused on Phalcon and as needed as a Computer Science lecturer.",
    "team_ruud_1": "Ruud has his own web development company in the Netherlands where he works on web based solutions for his clients.",
    "team_ruud_2": "As an early Phalcon adapter he always followed the project closely and is using Phalcon in his daily work.",
    "team_ruud_3": "He is passionate about performance and loves working with the team and collaborators to make Phalcon better with every commit.",
    "team_serghei_1": "Serghei has been working as a Ruby/PHP developer for over 8 years and has been specializing in web application development. As a supporter and advocate of Behavior Driven Development (BDD) is also a member of the <a href=':1:'>Codeception</a> team.",
    "team_serghei_2": "Serghei can be found neck deep in innovative technologies which introduced him in Phalcon. He is responsible for the coordination of bug fixes, testing, developer tools, incubator and support other Phalcon-related projects.",
    "team_serghei_3": "When he's not working, Serghei enjoys watch documentaries, science fiction movies and sometimes plays Mahjong or Go.",
    "template_engine_volt": "Template Engine (Volt)",
    "template_engine_volt_1": "Volt is an ultra-fast and designer friendly templating language written in Zephir/C for PHP. It provides you a set of helpers to write views in an easy way. Volt is highly integrated with other components of Phalcon, just as you can use it as a stand-alone component in your applications.",
    "template_engine_volt_description": "A template engine inspired by Jinja but built in C for PHP",
    "template_engines": "Template Engines",
    "template_engines_1": "Views represent the user interface of your application. Views are often HTML files with embedded PHP code that perform tasks related solely to the presentation of the data. Views handle the job of providing data to the web browser or other tool that is used to make requests from your application.",
    "template_engines_description": "Views represent the user interface of your application",
    "testimonials": "Referenzen",
    "testimonials_1": "Greetings, Phalcon team! I have a project, built on Phalcon framework. It's a Guitarama (<a href=':1:'>:2:</a>) - guitars tabs and chords catalog. The site is aimed at the Russian audience, and uses the Russian language, but I hope, there will be no problem to understand most of pages. The site was re-launched on a new platform in the beginning of January, 2013 and has since shown steady growth. Current daily visits:  ~1500 unique visitors, ~5000 page views. The site is running on an old physical server 1хP4-3Ghz, 4GB RAM. Once again, thank you for a great framework and all what you are doing: ).",
    "testimonials_2": "Hello, Phalcon team. I would like to share with you our success story of using Phalcon in <a href=':1:'>:2:</a> and <a href=':3:'>:4:</a> projects, the most visited and highloaded sites in Kazakhstan, ranked in TOP-10 classified sites in the CIS. Both sites work on single RESTful-like API written on Phalcon\\Mvc\\Micro. On peak loads API processes something like 400 req/sec and this is not a limit. Moving to Phalcon allowed us to reduce response generation time and the consumption of CPU and RAM, as well as to reduce the time of development process. We will continue using Phalcon in our new projects. Thank you for the great work you are doing!",
    "testimonials_3": "Phalcon Team, The framework you guys have created is amazing. I've never used a framework that has combined speed, efficiency, brevity, and naturality all in one package. I intend on championing and contributing back to the project in any way that I can. I embarked recently on an ~800 hour project and am happy to say that we are using Phalcon Framework. Bravo.",
    "testimonials_4": "Hi guys, I just ran across Phalcon and it's just awesome! I've merely wanted to say to you how awesome you are! So, thanks for this framework and keep up the good work!",
    "testimonials_5": "Hi Guys, i wrote simple url-shortener service with phalcon. That was amazing! really. <a href=':1:'>:2:</a>. Demo is here: <a href=':3:'>:4:</a>)",
    "testimonials_6": "Hello Phalcon Team, I created a small project designed for Polish users using your framework. I have to admit that the performance is amazing, congratulations good job. Service to validate the content of the web pages in Polish language <a href=':1:'>:2:</a>",
    "testimonials_7": "Hi guys! Just wanted to share with you the latest release of our old project - <a href=':1:'>:2: </a>. Switching to phalcon allowed us to halve the server load compared to the previous framework, which is great!",
    "testimonials_description": "Below is a collection of testimonials and success stories, from you, the developers and users of Phalcon PHP. We always welcome emails with success stories and will be posting those in our blog. If you wish to send us your success story or get in touch with us, feel free to mail us at <a href='mailto: :1:'>:2:</a>.",
    "toggle_navigation": "Navigation umschalten",
    "transactions": "Transaktionen",
    "transactions_1": "When a process performs multiple database operations, it might be important that each step is completed successfully so that data integrity can be maintained. Transactions offer the ability to ensure that all database operations have been executed successfully before the data is committed to the database.",
    "transactions_2": "Create a transaction manager",
    "transactions_3": "Request a transaction",
    "transactions_4": "Get the robots to be deleted",
    "transactions_5": "Something is wrong - rollback transaction",
    "transactions_6": "Everything is OK - commit transaction",
    "transactions_7": "Robots were deleted successfully!",
    "transactions_8": "Failed, reason: ",
    "transactions_description": "Transactions in Phalcon allows to keep the data integrity safe.",
    "try_phalcon": "Try Phalcon",
    "tutorial": "Tutorial",
    "views_and_frontend": "Views & frontend",
    "watch_demo": "Watch the demo video",
    "404-title": "404",
    "404-about": "Ooops! Something went wrong.",
    "404-button": "Back To Home",
    "404-team": "<3 Phalcon Team"
}
