{
    "about": "소개",
    "about_blog": "블로그",
    "about_blog_1": "글쓰는걸 좋아한다면, <a href=':1:'>우리의 블로그</a>에 튜토리얼을 써주세요. 만약 당신의 블로그에 Phalcon 에 대한 글이 있다면 저희가 SNS 페이지에 공유하여 많은 사람이 보게 만들수 있습니다. 블로그 글이 영어가 아니라도 가능한 한 번역해서 공유하고자 합니다. Phalcon에 관련된 글이 있는 PHP 관련 블로그를 알고 있다면 저희에게 알려주세요.",
    "about_description_1": "멋진 프로젝트는 멋진 사람들의 도움이 필요합니다. 저희가 아직 당신을 잘 모를 수도 있지만, 당신이 더 나은 웹을 구축하는데 있어서 딱 맞는 적임자가 될 것이라고 생각합니다. 우리는 다 함께, 세상을 바꿀 준비가 되있습니다! 여기 Phalcon에서 우리는 PHP를 위한 새로운 세대의 프레임 워크를 구축하고 있습니다. 우리는 당신이 쉽고 재미있는 방식으로 개발할 수 있도록 도우면서 동시에 놀라운 성능을 제공하고자 합니다.",
    "about_description_2": "저희가 Phalcon을 즐기는 만큼 여러분도 즐기시길 기원합니다. 협력과 도움은 언제나 환영입니다! <strong>C개발자가 아니라도 Phalcon을 돕는데는 아무 문제가 없습니다!</strong> 도움을 줄 수 있는 영역이 엄청나게 많으니까요:",
    "about_documentation": "문서",
    "about_documentation_1": "이 웹사이트의 저장소는 <a href=':1:'>github</a>에 있습니다. 저장소는 영어 문서에 대한 소스로만 사용하고 있습니다!",
    "about_documentation_2": "문서에 대한 교정, 추가 및 향상은 언제나 환영입니다. 저장소를 클론하신 후 해당 내용에 대해 PR 만 요청해주시면 됩니다!",
    "about_documentation_3": "컨텐츠 일부를 다른 언어로 번역해서 비영어권 개발자들을 도와주실 수 있다면, 정말 멋질것 같아요! 번역을 위해 저희는 <a href=':2:'>:3:</a>을(를) 사용하고 있으며, 프로젝트는 <a href=':4:'>여기</a>에 있습니다.",
    "about_donations_sponsoring": "기부 / 후원",
    "about_evangelism": "주변에 알리기",
    "about_evangelism_1": "Phalcon이 뭔지, 정말 동작하는지 전혀 알지 못하는 사람들이 아직 너무나 많습니다. 많은 개발자들이 Phalcon이 도대체 뭐하는 건지, Phalcon이 어떻게 도움을 줄 수 있는지에 대해서 듣게되면 좋아하게 될것이라고 확신합니다. 만약 당신이 PHP 관련 행사나 미팅에서 Phalcon에 대해 이야기하고자 한다면 저희가 전력으로 지원하겠습니다. PHP 개발을 혁신시킬 수 있는 도구에 대해 누구든 알고싶지 않을까요?",
    "about_facebook_page": "Facebook 페이지",
    "about_flying_with_phalcon": "Phalcon과 함께해주셔서 감사합니다! &lt;3",
    "about_follow_on_gab": "Gab에서 팔로우",
    "about_follow_on_twitter": "Twitter에서 팔로우",
    "about_official_blog": "공식 블로그",
    "about_sample_applications": "어플리케이션 예제",
    "about_sample_apps_1": "규모가 큰 예제는 Phalcon으로 얼마나 큰 것들을 만들 수 있는지 좀 더 잘 이해하는데에 큰 도움이 됩니다. 저장소를 공유하셔서 다른 사람들의 일에 도움을 줄 수도 있고, 다른사람들도 당신의 작업에 대해 피드백을 남길 수 있도록 해 보세요!",
    "about_screencasts": "스크린캐스트",
    "about_screencasts_1": "우린 스크린캐스트를 사랑합니다. 시간적 여유가 있고 커뮤니티에 도움을 주고 싶으시다면, 팔콘프레임워크의 기능을 가르치기 위한 동영상을 만들어주세요. 우리의 <a href=':1:'>유튜브 채널</a>에서 가이드를 확인하세요.",
    "about_share_experiences_1": "부끄러워하지 마시고, Phalcon의 어떤 점이 유용했는지 커뮤니티에 마음껏 공유하여 주시기 바랍니다. 만약 Phalcon이 당신에게 성공사례라면, 저희가 커뮤니티에 공유할 수 있도록 해주세요. 또한 어떤 컴퍼넌트가 추가적인 작업을 필요로 했는지, 어떤것들이 상대적으로 더 구현하기 쉬웠는지에 대해서도 토론하실 수 있습니다. 신규기능 요청에 대한 의견들 전부를 즉시 반영하는 건 쉽지 않겠지만, 그러한 것들이 이 프로젝트의 미래를 만들어 나가는 데에 큰 도움이 됩니다. 여러분의 피드백은 우리 모두에게 도움이 됩니다.",
    "about_share_your_experiences": "경험을 공유해 주세요",
    "about_social_networks": "SNS",
    "about_social_networks_1": "Phalcon 은 더 나은 것을 만들고자 하는 우리의 열정을 통해 매일 진화하고 있습니다. SNS는 이제 우리 삶의 일부이며, 우리 모두가 그것을 통해 다른 사람들과 상호 작용합니다. Phalcon 사용 경험을 SNS상에서 친구들과 공유하는 것은 프로젝트의 가시성을 크게 증가시킬 것입니다. 점점 더 많은 사람들이 우리 커뮤니티에 참여하게 될 것이고, 결국은 더 강력하고 훨씬 더 많은 기능들을 제공하고 인기도 치솟을 것입니다. '+1' 해주시는것 처럼, 우리가 지속적으로 모든 SNS에 게시하는 글들을 재공유하고 그 글들에 대한 대한 토론에 참여해 주세요. 당신의 노력을 통해 Phalcon을 발견한 사람들은 당신께 진심으로 감사드릴 거예요!",
    "about_social_networks_2": "우리는 대부분의 유명 SNS에서 활동 중입니다. 팔로우 해주시면, 프로젝트의 지명도 향상에 도움이 됩니다: ",
    "about_sponsoring_1": "우리는 작지만 열심히 일하는 효과적인 핵심 개발 팀입니다. 우리는 프로젝트에 가능한 한 많은 시간을 할애하려고 합니다. 이 프로젝트에 대한 우리의 열정은 프로젝트가 매일매일 더 좋아지게 만드는 원동력입니다. Phalcon는 오픈 소스 소프트웨어이기 때무에 지속적인 발전을 위해서는 자원 봉사자의 노력이 필요합니다. 프로젝트에 기부하거나 개발을 후원하여 우리가 적극적인 개발을 유지하는데 도움을 주실 수 있습니다. 이 프로젝트에 전념하는 시간과 리소스가 늘어난다는 것은 더 많은 활동 및 개선, 향상된 지원, 놀라운기능들 등을 만날 수 있다는 것을 의미합니다..",
    "about_star_on_github": "Github에서 프로젝트를 시작하세요",
    "about_tests": "테스트",
    "about_tests_1": "모든 소프트웨어는 버그가 있습니다. 만약 버그를 하나라도 발견하신다면, 꼭 우리에게 알려주세요. 우리는 <a href=':1:'>16000</a>개가 넘는 테스트케이스를 가지고 있습니다. 하지만 유닛테스트 만으론 절대 충분하지 않습니다. 새로운 테스트케이스를 작성하거나 원래 있던 테스트케이스를 향상시켜 우리를 도와주세요. 추가되는 모든 테스트들은 Phalcon프레임워크를 더욱 안정적으로 만듭니다.",
    "about_thank_you": "감사합니다!",
    "about_thank_you_1": "우리는 Phalcon을 최고의 프레임 워크를 만들기 위해 우리를 밀어주는 기여자들과 커뮤니티의 모든 구성원들에게 감사를 드리고 싶습니다. 친절한 말 몇마디와 참여는 우리가 더 잘할 수 있는 원동력입니다. 우리는 당신이 Phalcon 에 대해 보내주는 신뢰에 부응하고 그 조차도 뛰어넘을 수 있기를 바랍니다.",
    "about_translations": "TRANSLATIONS",
    "about_translations_1": "We are trying to reach as many developers as possible, breaking down the language barriers. We are using <a href=':1:'>:2:</a>, to handle all the words or sentences that need to be translated for this site. The project repository is located <a href=':3:'>here</a>.",
    "acl": "ACL",
    "acl_1": "This is how you can built the access control list (ACL):",
    "acl_2": "Create the ACL",
    "acl_3": "The default action is DENY access",
    "acl_4": "Register two roles, Users",
    "acl_5": "and Guests",
    "acl_description": "Access Control List allows users to access the modules they're authorized to",
    "auto_loader": "Autoloader",
    "auto_loader_1": "Register namespaces, prefixes, directories or classes. Take advantage of the autoloader events and maintain full control over what files are loaded and from where.",
    "auto_loader_2": "Creates the autoloader",
    "auto_loader_3": "Register some namespaces",
    "auto_loader_4": "Register autoloader",
    "autoloader": "Autoloader",
    "autoloader_description": "Provides the autoloading mechanism of PHP classes following PSR-4.",
    "basic_features": "Basic Features",
    "blog": "Blog",
    "built_with_phalcon": "Built with Phalcon",
    "cache": "Cache",
    "cache_1": "The cache component allows faster access to frequently used or already processed data. It supports many backends such as Redis, Memcached, Mongo, Files, Apc and more",
    "cache_2": "Set the models cache service",
    "cache_3": "Cache data for one day by default",
    "cache_4": "Memcached connection settings",
    "cache_description": "Improve your performance with many of the backend caches that Phalcon provides",
    "community": "Community",
    "contribute": "Contribute",
    "contributors": "Phalcon contributors",
    "contributors_description": "Phalcon is improved everyday by our amazing community",
    "consulting": "Consulting",
    "consulting_mctekk_1": "MCTekK jumped on the Phalcon wagon since day one. From its conception we saw the great advantages that Phalcon was offering and could offer in the future.",
    "consulting_mctekk_2": "우리는 Phalcon에 대해 충분한 경험을 가지고 있었고 이 프레임워크를 사용하여 무수하게 많은 프로젝트를 개발했습니다. 우리는 Phlacon에 대한 당신의 준비성, 신속성 및 품질개선을 돕기 위해 필요한 어떤 것이든 조언을 드리고자 합니다.",
    "consulting_mctekk_3": "저희에게 연락하시려면, 우리가 참여한 프로젝트들을 정리해둔 <a href=':1:'>웹사이트</a>를 방문하세요.",
    "consulting_mctekk_header": "MCTekK은 웹 및 모바일 개발 전문 회사로써, 다양한 고품질 Phalcon 기반 프로젝트를 수행왔습니다.",
    "crypt": "암호화",
    "crypt_description": "인증되지 않은 서드파티들로 부터 중요한 데이터를 안전하게 보호하기 위해 암호화/복호화를 해주세요",
    "data_and_storage": "데이터 & 스토리지",
    "dependency_injection": "의존성 주입",
    "dependency_injection_1": "팔콘은 의존성 주입이라는 강력하지만 이해하고 사용하기 쉬운 패턴 위에 만들어졌습니다. 서비스를 한번 초기화 하거나 정의하면 - 어플리케이션 어디에서나 사용할 수 있습니다.",
    "dependency_injection_2": "의존성주입 컨테이너 만들기",
    "dependency_injection_3": "클래스, 함수, 컴포넌트 등록",
    "dependency_injection_4": "다른 곳에서 사용하기",
    "dependency_injection_description": "의존성 주입과 서비스 위치는 그 자체로 컨테이너가 됩니다.",
    "development": "개발자",
    "docs": "문서",
    "documentation": "문서",
    "donate": "후원하기",
    "download": "다운로드",
    "download_arch": "Arch Linux",
    "download_arch_1": "There is a PKGBUILD for ArchLinux, available <a href=':1:'>here</a>",
    "download_compilation": "Compilation",
    "download_compilation_1": "On Linux you can easily compile and install the extension from source code.",
    "download_compilation_11": "1. To create the extension from C source follow these steps: ",
    "download_compilation_12": "2. Add the extension to your php.ini: ",
    "download_compilation_13": "3. Finally, restart the webserver",
    "download_cpanel": "cPanel",
    "download_cpanel_1": "After requests from the community, the cPanel developers released a custom module that allows for installation of Phalcon in cPanel hosted sites. Information can be found <a href=':1:'>here</a>. The module is maintained in <a href=':2:'>Github</a>.",
    "download_dependencies": "Dependencies",
    "download_dependencies_1": "Although Phalcon does not binary link to other extensions it does use some of them to offer functionality. The extensions used are: ",
    "download_dependencies_2": "It is not necessary for all the above extensions to be present in the system that has Phalcon installed. You can only install the ones that meet your needs. For instance if you use a MySQL database, then you can only load PDO and PDO/MySQL ignoring the Oracle, SQlite, Postgresql and Mongo.",
    "download_developer_tools": "Developer Tools",
    "download_devtools_1": "These tools are a collection of useful scripts to generate skeleton code. Core components of your application can be generated with a simple command, allowing you to easily develop applications using Phalcon.",
    "download_devtools_composer": "Installing via Composer",
    "download_devtools_composer_1": "Install composer in a common location or in your project: ",
    "download_devtools_composer_2": "Create the composer.json file as follows: ",
    "download_devtools_composer_3": "Run the composer installer: ",
    "download_devtools_composer_4": "Create a symbolic link to the phalcon.php script: ",
    "download_devtools_docs": "Documentation:  <a href=':1:'>Phalcon Developer Tools</a>",
    "download_devtools_download": "You can download or clone a cross platform package containing the developer tools from <a href=':1:'>Github</a>.",
    "download_examples": "Pre-Installed examples",
    "download_examples_1": "The following examples are pre-installed on each vagrant box: ",
    "download_freebsd": "FreeBSD",
    "download_freebsd_1": "A port is available for FreeBSD. You only need these few commands to install it: ",
    "download_ide_stubs": "IDE stubs",
    "download_ide_stubs_1": "The video below outlines how to enable IDE stubs for PhpStorm",
    "download_linux": "Linux/Unix/Mac",
    "download_need_help": "Need help?",
    "download_need_help_1": "Have a look at our <a href=':1:'>support page</a> for ways to get support. We will do our best to help you.",
    "download_note": "Phalcon is a C extension, so you need to download a binary for your platform or compile it from source code.",
    "download_opensuse": "OpenSUSE",
    "download_opensuse_1": "There is a package available <a href=':1:'>here</a> (thanks to <a href=':2:'>Mariusz Łączak</a>)",
    "download_requirements": "Requirements",
    "download_requirements_1": "We need some packages previously installed: ",
    "download_requirements_2": "PHP 5.x development resources",
    "download_requirements_3": "GCC compiler",
    "download_source_code": "Source Code:  <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
    "download_source_code_switch": "Source Code (please switch to the relevant branch): <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
    "download_ubuntu": "To install Phalcon on Ubuntu or Debian you need to follow these steps: ",
    "download_ubuntu_1": "If you are missing apt-add-repository run the following command: ",
    "download_ubuntu_2": "If you wish to install the legacy version of Phalcon (1.x) use the following PPA: ",
    "download_ubuntu_or_debian": "Ubuntu or Debian",
    "download_windows": "Windows DLLs",
    "download_windows_download": "Download",
    "download_windows_dlls": "Windows DLLs can be downloaded from our Github release page <a href=':1:'>here</a>",
    "download_windows_guides": "Related Guides",
    "download_windows_guides_wamp": "Installation on WAMP",
    "download_windows_guides_xampp": "Installation on XAMPP",
    "download_windows_installation": "Installation",
    "download_windows_installation_1": "To use phalcon on Windows you can download a DLL library. Edit your php.ini, append at the end, and restart your webserver to load the extension. <a href=':1:'>More</a>.",
    "download_windows_note": "We highly recommend you use the latest version of PHP corresponding to our DLLs, so as to take advantage of the full feature set of Phalcon.",
    "dropdown_menu_title_social": "Social",
    "dropdown_menu_title_help": "Help",
    "encryption": "Encryption",
    "encryption_1": "Phalcon provides encryption facilities via the Phalcon\\Crypt component. This class offers simple object-oriented wrappers to the openssl PHP's encryption library.",
    "encryption_2": "This is a secret key (32 bytes).",
    "encryption_3": "The text you want to encrypt.",
    "events": "Events",
    "events_description": "Extend the most of the framework components by setting 'hook points'. Create your own events and make your application more flexible and powerful",
    "events_management": "Events Management",
    "events_management_1": "An EventsManager allows us to attach listeners to a particular type of event. The type that interests us now is 'dispatch'. The following code filters all events produced by the Dispatcher:",
    "events_management_2": "Create an events manager",
    "events_management_3": "Listen for events produced in the",
    "events_management_6": "dispatcher using the SecurityPlugin",
    "events_management_4": "Handle exceptions and not-found",
    "events_management_7": "exceptions using NotFoundPlugin",
    "events_management_5": "Assign the events manager",
    "events_management_8": "to the dispatcher",
    "features": "Features",
    "flash_messages": "Flash messages",
    "flash_messages_1": "Use the flash notifier to show notifications to a user in a web application:",
    "flash_messages_2": "there were errors in this form",
    "flash_messages_3": "yes!, everything is fine",
    "flash_messages_4": "this is a notice for users",
    "flash_messages_5": "this is just a warning",
    "flash_messages_description": "Flash messages are used to notify the user about the state of actions.",
    "forms_builder": "Forms Builder",
    "forms_builder_1": "Each element in the form can be rendered as required by the developer. Internally, Phalcon\\Tag is used to produce the correct HTML for each element and you can pass additional HTML attributes as the second parameter of render():",
    "forms_builder_2": "Home",
    "forms_builder_3": "Cellphone",
    "forms_builder_description": "Easily create HTML forms",
    "forum": "Forum",
    "get_phalcon": "Get Phalcon",
    "header_slogan": "Its innovative architecture makes Phalcon the fastest PHP framework ever built!",
    "header_tagline": "A full-stack PHP framework delivered as a C-extension",
    "header_description": "Developers do not need to know C to use Phalcon. Its functionality is exposed as PHP classes and interfaces under the Phalcon namespace, ready to be used.",
    "help": "Help",
    "high_performance_php_framework": "High Performance PHP Framework",
    "hosting": "Hosting",
    "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud delivers scalable, pay-as-you-go compute capacity in the cloud.",
    "hosting_amazon_ec2_2": "Select a pre-configured, templated Amazon Machine Image (AMI) to get up and running immediately. Or create an AMI containing your applications, libraries, data, and associated configuration settings. <a href=':1:'>See more</a>",
    "hosting_amazon_ec2_title": "Amazon EC2",
    "hosting_aspnix_1": "ASPnix provides superior Linux cPanel and Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
    "hosting_aspnix_2": "Phalcon is supported on all Windows and Linux cPanel shared web hosting packages and plans, no configuration or installation required! ASPnix offers a variety of PHP versions from 5.2 - 7.2 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
    "hosting_aspnix_title": "ASPnix",
    "hosting_azure_1": "The <a href=':1:'>Windows Azure cloud</a> provides you with highly scalable and manageable Windows hosting for your web apps. Use Phalcon to reduce your instance costs.",
    "hosting_azure_2": "To install Phalcon, follow the step by step procedure in <a href=':1:'>this SitePoint article</a>.",
    "hosting_azure_title": "Windows Azure",
    "hosting_description": "Phalcon can be installed on any machine on which the hosting provider offers SSH root access (or sudo). Below is a list of reputable companies that offer such services: ",
    "hosting_digital_ocean_1": "Blazing Fast Cloud Technology. Built for developers. Deploy an SSD cloud server in 55 seconds. <a href=':1:'>See more</a>",
    "hosting_digital_ocean_2": "Follow this <a href=':1:'>tutorial</a> to get started",
    "hosting_digital_ocean_title": "Digital Ocean",
    "hosting_dcthost_1": "DCT Host offers <a href=':1:'>affordable and high quality hosting plans</a>. We have a wide range of tools available on our website hosting plans for developers to create their next best website or application with!",
    "hosting_dcthost_2": "By default, Phalcon is installed on all of our website hosting packages. If you're looking to get setup on a virtual server, we can also assist in installing Phalcon on this, too! We're big supporters of frameworks and always love to be supporting & using the latest web technologies!",
    "hosting_dcthost_title": "DCT Host",
    "hosting_fortrabbit_1": "Fortrabbit offers many hosting plans (there is one for developers and is free - with some limitations) that would satisfy the needs of most of the developers that wish to either try Phalcon or deploy their applications using it.",
    "hosting_fortrabbit_2": "They offer a variety of <a href=':1:'>extensions</a> that would satisfy even the most demanding project.",
    "hosting_fortrabbit_3": "Stable versions of Phalcon are pre-installed, you can activate them from the administration dashboard.",
    "hosting_fortrabbit_title": "Fortrabbit",
    "hosting_install_instructions": "Install Phalcon using the standard instructions of installation.",
    "hosting_kinghost_1": "Since 2006, KingHost is one of the largest hosting company sites in Brazil and already has over 300,000 sites hosted with approximately 60,000 customers. Headquartered in Porto Alegre (RS) , with data centers in Brazil , the company offers the hosting service of shared servers, specific plans for custom developers and projects in the area of enterprise solutions , including cloud computing and dedicated servers. It also offers digital marketing solutions such as email marketing and security solutions.",
    "hosting_kinghost_title": "KingHost",
    "hosting_layershift_1": "Next generation, auto-sizing PaaS for Java, PHP, Ruby, Python, and Node.js apps. Fully isolated self-scaling role-based containers for each customer, including choice of Apache or Nginx, and full range of SQL and NoSQL servers. Pay for resource usage, not server instance size. SSD-powered. UK hosted.",
    "hosting_layershift_2": "Follow this <a href=':1:'>tutorial</a> to get started",
    "hosting_layershift_title": "Layershift",
    "hosting_linode_1": "Deploy and Manage Linux Virtual Servers in the Linode Cloud. Get a server running in seconds with your choice of Linux distro, resources, and node location. <a href=':1:'>See more</a>",
    "hosting_linode_title": "Linode",
    "hosting_mediasecure_1": "High performance Dedicated Servers with protection against threats including Distributed Denial of Service (DDoS) attacks. Our high-capacity DDoS-Protected network can automatically protect your dedicated server from DDoS attacks up to 4.2 Tbps. <a href=':1:'>See more</a>",
    "hosting_mediasecure_title": "Mediasecure",
    "hosting_rackspace_1": "Cloud Servers are virtual machines running Linux or Windows&reg; Server in the Rackspace Cloud. You can scale resources like CPU, memory, and storage up or down, depending on your needs. Best of all, you can pay as you go. <a href=':1:'>See more</a>",
    "hosting_rackspace_title": "Rackspace",
    "hosting_webfaction_1": "WebFaction Hosting for developers. Full shell access to fast servers with all your favorite tools pre-installed and maintained for the user.",
    "hosting_webfaction_2": "To install Phalcon in WebFaction, follow the instructions outlined <a href=':1:'>here</a>",
    "hosting_webfaction_title": "WebFaction",
    "i18n": "i18n",
    "i18n_1": "The component Phalcon\\Translate aids in creating multilingual applications. Applications using this component, display content in different languages, based on the user's chosen language supported by the application.",
    "i18n_2": "Browser's best language",
    "i18n_3": "Check the lang translation file",
    "i18n_4": "Fallback to some default",
    "i18n_5": "Return a translation object",
    "i18n_description": "Translate your applications to many languages easily",
    "installing_phalcon_php": "Installing Phalcon PHP",
    "issue_tracker": "Issue Tracker",
    "join_our_community": "Come join our vibrant developer community!",
    "join_our_community_description": "Community contributions in Extensions, Plugins, Adapters, VM, examples, source code... and more",
    "language_text": "Korean",
    "learn": "Learn",
    "license_new_bsd": "Phalcon is an open-source PHP framework <br />built as a C-extension. It is available under the <br /><a href='http://opensource.org/licenses/BSD-3-Clause' target='_blank'>new BSD License</a>.",
    "low_overhead": "Low overhead",
    "low_overhead_1": "Zephir/C extensions are loaded together with PHP one time on the web server's daemon start process",
    "low_overhead_2": "Classes and functions provided by the extension are ready to use for any application",
    "low_overhead_3": "The code is compiled and isn't interpreted because it's already compiled to a specific platform and processor",
    "low_overhead_4": "Thanks to its low-level architecture and optimizations <strong>Phalcon provides the lowest overhead for MVC-based applications</strong>",
    "low_overhead_description": "Low memory consumption and CPU compared to traditional frameworks",
    "low_overhead_title": "PHP C-extension (Phalcon)",
    "more": "MORE...",
    "mvc": "MVC",
    "mvc_1": "Build single and multi-module applications with ease and pleasure. Using the file structure, scheme and patterns you already know.",
    "mvc_hmvc": "MVC & HMVC",
    "mvc_hmvc_description": "Modules, components, models, views and controllers",
    "odm_for_mongo": "ODM for MongoDB",
    "odm_for_mongo_1": "In addition to its ability to map tables in relational databases, Phalcon can map documents to a MongoDB database. The ODM offers a CRUD functionality, events, validations among other services.",
    "odm_for_mongo_2": "How many robots are there?",
    "odm_for_mongo_3": "How many mechanical robots are there?",
    "odm_for_mongo_4": "There are count($robots) robots",
    "odm_for_mongo_description": "Object Document Mapping for MongoDB",
    "or": "or",
    "orm": "ORM",
    "orm_1": "A powerful ORM is provided by Phalcon allowing you to manipulate database records as classes and objects. MySQL, PostgreSQL and SQLite are supported out of the box.",
    "orm_description": "Object Relational Mapping",
    "phalcon_team": "Phalcon Team",
    "phalcon_team_1": "Many more people",
    "phalcon_team_2": "Phalcon is and has always been an effort of many volunteers: ",
    "phql": "PHQL",
    "phql_1": "PHQL is a high-level, object-oriented SQL dialect that allows to write queries using a standardized SQL-like language. PHQL is implemented as a parser (written in C) that translates syntax in that of the target RDBMS. To achieve the highest performance possible, Phalcon provides a parser that uses the same technology as SQLite. This technology provides a small in-memory parser with a very low memory footprint that is also thread-safe.",
    "phql_2": "Name",
    "phql_description": "The powerful and secure Phalcon Query Language, PHQL",
    "polling_app": "A polling app built from scratch in < 15 min",
    "queueing": "Queueing - background process",
    "queueing_1": "Activities like processing videos, resizing images or sending emails aren't suitable to be executed online or in real time because it may slow the loading time of pages and severely impact the user experience. The best solution here is to implement background jobs. The web application puts jobs into a queue and which will be processed separately.",
    "queueing_2": "Connect to the queue",
    "queueing_3": "Insert the job in the queue",
    "queueing_description": "Use the built-in queueing system in Phalcon to schedule jobs and reduce the load of your web server",
    "rest": "Rest",
    "rest_description": "In this case, you can use either a micro or full stack application to meet your goal. In addition, a powerful set of HTTP helpers.",
    "restful_services": "Restful Services",
    "restful_services_1": "Writing REST servers and applications has never been easier. No boilerplate. Simple services will fit in one file.",
    "restful_services_2": "Returning data in JSON",
    "router": "Router",
    "router_1": "Routing as it supposed to be. Nothing more. Nothing less.",
    "router_2": "Create the router",
    "router_3": "Define a route",
    "router_description": "Phalcon\\Mvc\\Router provides advanced routing capabilities.",
    "see_for_yourself": "See for yourself...",
    "sharding": "Sharding",
    "sharding_1": "Attach models to different databases",
    "sharding_2": "This service returns a MySQL database",
    "sharding_3": "This service returns a PostgreSQL database",
    "sharding_description": "Connect, store and retrieve data from many database systems at the same time",
    "site": "사이트",
    "social": "소셜",
    "sponsored_by": "후원",
    "sponsors": "후원자",
    "sponsors_and_supporters": "후원자와 지지자",
    "sponsors_and_supporters_upper": "후원자와 지지자",
    "sponsors_become_patron": "후원자가 되세요!",
    "sponsors_description_1": "현재 작업과 향후 Phalcon 개발을 후원하고자 하는 분들을 위해 우리는 다양한 예산에 맞는 스폰서십 옵션을 제공합니다. 작업을 후원 해주신다면 우리는 프로젝트에 더 많은 시간을 할애하여 버그를 빠르게 수정하고 새로운 기능을 빠르게 추가하고, 프로젝트의 안정성을 높일 수 있을 것입니다.",
    "sponsors_our_great_sponsors": "이분들께서 후원해주셨습니다! 감사합니다!",
    "store": "스토어",
    "support": "지원",
    "support_discord": "Phalcon <a href=':1:'>Discord</a>에 가입하세요",
    "support_documentation_1": "항상 제일먼저 <a href=':1:'>문서</a> 를 이용해 주세요. 문서에서 원하는 것을 찾기 위해 검색기능을 사용하실 수도 있습니다. 질문에 대한 답을 아직 얻지 못했다면, 아래에 더 많은 옵션이 있습니다.",
    "support_download_page": "다운로드 페이지",
    "support_note_1": "하지만 우리의 훌륭한 커뮤니티와 기여자들은 당신을 기꺼이 도울겁니다! 도움을 얻으시려면 이들 커뮤니티 리소스를 활용하세요.",
    "support_note_2": "많은 버그들이 사용자들이 최신 버전을 사용하지 않기 때문에 일어 납니다. <a href=':1:'>다운로드 페이지</a>를 방문해서 최신버전을 다운로드(혹은 컴파일)하시고, 그래도 문제가 계속 발생하는지 확인해주세요.",
    "support_phalcon_forum": "질문은 <a href=':1:'>공식 포럼</a>에 해주세요",
    "support_please_note": "주의: ",
    "support_please_note_1": "Stack Overflow는 Phalcon 지원만 전담하는 곳은 아닙니다.",
    "support_please_note_2": "새로운 버그를 그곳에 보고하지 말아주세요. 버그리포팅은 Github의 <a href=':1:'>이슈트래커</a>를 사용해주시길 부탁드립니다.",
    "support_please_note_3": "그곳에 신규기능 추가요청을 하지 말아주세요. 요청은 Github의 <a href=':1:'>이슈트래커</a>를 사용해주시면 감사드리겠습니다.",
    "support_please_note_4": "질문 시 'phalcon' 태그가 포함되어 있는지 확인하십시오.",
    "support_please_note_5": "질문 내용 중에 반드시 'Phalcon' 단어를 언급했는지 확인해주세요.",
    "support_reporting_a_bug": "버그 신고",
    "support_reporting_a_bug_0": "만약 당신이 버그를 발견했다고 생각하신다면 <a href=':1:'>이슈를 열어주세요</a>",
    "support_reporting_a_bug_1": "위의 옵션들을 모두 시도해 봤다면 GIthub의 <a href=':1:'>이슈트래커</a>에 버그를 신고해주세요.",
    "support_slack": "덜 활성화 되어있긴 하지만 여전히 활동 중인 커뮤니티가 <a href=':1:'>슬랙</a>에 있습니다.",
    "support_stack_overflow": "질문하는 방법 중 또 다른 하나는 <a href=':1:' target='_blank'>스택오버플로우</a>에 질문을 올리고 <a href=':2:'><code>phalcon</code></a> 태그를 다는 것입니다.",
    "support_social_network_accounts": "우리의 SNS 계정은 다음과 같습니다:",
    "support_us": "지원하기",
    "team": "팀",
    "team_andres_1": "Andres는 오픈소스프로젝트가 낯설지 않습니다. 최근 9년간, PHP 를 위한 프레임워크의 설계와 배포를 했었고, 웹 개발 - 그의 주된 관심사입니다 - 에 참여해 왔습니다.",
    "team_andres_2": "TR35 우승자인 Andres의 주된 관심사는 언제나, 주로 성능에 촛점을 맞춰서, 업무에 적합한 도구를 선택/적용하거나 사용하는 데에 가 있습니다. 그래서 2011년 업무 중에, PHP 개발자를 위해 사용성, 기능, 그리고 무엇보다도 성능에 중점을 둔 새로운 종류의 프레임워크를 만들어보자는 새로운 아이디어가 떠올랐습니다.",
    "team_andres_3": "이 새롭고 혁신적인 접근방식을 통해 Phalcon이 태어나게 되었습니다. 개발자들에게 풍부한 기능을 제공하면서도 성능은 극대화되고 자원의 사용량은 낮게 유지할 수 있도록, C 언어로 작성된 PHP 프레임워크이지요.",
    "team_andres_4": "Andres는 Phalcon이 있게 만든 핵심이었으며, 비록 이제는 이 프로젝트를 떠났지만 우리는 언제나 그의 선견지명에 감사하고 있습니다.",
    "team_nikos_1": "Nikos 은 20 년 이상 IT 업계에 있었습니다. 그는 2000 년에 PHP 세계에 입문한 이후 개인 프로젝트들과 그의 고용주를 위한 프로젝트들에 계속해서 PHP를 사용해 왔습니다.",
    "team_nikos_2": "그는 새로운 기술을 발견하고 그것을 기존의 어플리케이션에 통합시키는 방법, 그래서 그 결과로 얻을 수 있는 잇점들을 찾는 것을 좋아합니다.",
    "team_nikos_3": "그는 테스트 주도 개발(TDD) 의 열렬한 지지자이며, 언제나 그의 코드 전체에 이 방법론을 적용시키려 노력합니다.",
    "team_nikos_4": "기존의 틀을 깨는 새롭고 혁신적인 기술에 대한 Niko의 지속적인 관심이 그가 Phalcon을 알게 된 계기였습니다. 그는 코어 팀에 합류했고 그의 작업은 주로 NFRs(비기능적 요구사항 - Non-Functional Requirements) 의 조율과 버그수정, 테스트 지원, 문서화 및 지원육성에 관련되어 있습니다. Niko는 프로젝트의 윈도우DLL 유지관리도 책임지고 있으며 가능한 최대한 사용자지원도 제공하고 있습니다.",
    "team_paul_1": "Paul은 지난 10년간 Phalcon과 같은 오픈소스 프레임워크의 도움을 받아 사용자 친화적인 소프트웨어를 만들 수 있어서 스스로를 정말 행운아라고 생각하고 있습니다. 그런 이유로, 그는 업무 외 시간에는 FOSS도구의 개선이나 자신과 같은 개발자들의 삶을 향상시키는데 시간을 쓰고 있습니다. 그는 심플한 코드와 직관적인 UX에 대한 강한 열망이 있으며, Phalcon 팀에서 문서화, 새로운 사용자경험, 기여자 관계관리 및 커뮤니티 지원을 담당하고 있습니다.",
    "team_paul_2": "Paul은 ReactJS, Webpack, Ruby, Elixir(Erlang) 같은 새롭게 떠오르는 기술들을 사용해서 직관적인 소프트웨어를 만들고 싶어하는 열정에 이끌려, 최근 회사를 창업했습니다. 이제 그는 계속해서 늘어나는 그 목록에 자랑스럽게 Zephir와 Phalcon을 추가했으며 기꺼이 이들의 혁신적인 기능을 옹호하는 치어리더로서의 역할을 맡았습니다.",
    "team_paul_3": "Paul은 코딩을 하지 않을 때에는, 아내의 따라서 영상촬영과 제작에 대한 관심을 키우고 있습니다. 그는 현재 컴퓨터과학 강의에 필요한 정도로 Phalcon에 촛점을 맞춘 교육 유튜브 채널을 운영하고 있습니다.",
    "team_ruud_1": "Ruud는 네덜란드에서 고객을 위한 웹기반 솔루션을 제공하는 웹개발사를 운영하고 있습니다.",
    "team_ruud_2": "초기 부터 Phalcon 을 적용한 개발자로서 그는 매일매일의 작업에 Phalcon을 사용하면서 언제나 이 프로젝트를 가까이에서 따라왔습니다.",
    "team_ruud_3": "그는 성능에 대한 열정을 가지고 있으며 Phalcon팀이나 공동작업자들과 함께 작업해서 커밋 하나하나마다 Phalcon이 더 좋아지는 것을 사랑합니다.",
    "team_serghei_1": "Serghei has been working as a Ruby/PHP developer for over 8 years and has been specializing in web application development. As a supporter and advocate of Behavior Driven Development (BDD) is also a member of the <a href=':1:'>Codeception</a> team.",
    "team_serghei_2": "Serghei can be found neck deep in innovative technologies which introduced him in Phalcon. He is responsible for the coordination of bug fixes, testing, developer tools, incubator and support other Phalcon-related projects.",
    "team_serghei_3": "When he's not working, Serghei enjoys watch documentaries, science fiction movies and sometimes plays Mahjong or Go.",
    "template_engine_volt": "Template Engine (Volt)",
    "template_engine_volt_1": "Volt is an ultra-fast and designer friendly templating language written in Zephir/C for PHP. It provides you a set of helpers to write views in an easy way. Volt is highly integrated with other components of Phalcon, just as you can use it as a stand-alone component in your applications.",
    "template_engine_volt_description": "A template engine inspired by Jinja but built in C for PHP",
    "template_engines": "Template Engines",
    "template_engines_1": "Views represent the user interface of your application. Views are often HTML files with embedded PHP code that perform tasks related solely to the presentation of the data. Views handle the job of providing data to the web browser or other tool that is used to make requests from your application.",
    "template_engines_description": "Views represent the user interface of your application",
    "testimonials": "Testimonials",
    "testimonials_1": "Greetings, Phalcon team! I have a project, built on Phalcon framework. It's a Guitarama (<a href=':1:'>:2:</a>) - guitars tabs and chords catalog. The site is aimed at the Russian audience, and uses the Russian language, but I hope, there will be no problem to understand most of pages. The site was re-launched on a new platform in the beginning of January, 2013 and has since shown steady growth. Current daily visits:  ~1500 unique visitors, ~5000 page views. The site is running on an old physical server 1хP4-3Ghz, 4GB RAM. Once again, thank you for a great framework and all what you are doing: ).",
    "testimonials_2": "Hello, Phalcon team. I would like to share with you our success story of using Phalcon in <a href=':1:'>:2:</a> and <a href=':3:'>:4:</a> projects, the most visited and highloaded sites in Kazakhstan, ranked in TOP-10 classified sites in the CIS. Both sites work on single RESTful-like API written on Phalcon\\Mvc\\Micro. On peak loads API processes something like 400 req/sec and this is not a limit. Moving to Phalcon allowed us to reduce response generation time and the consumption of CPU and RAM, as well as to reduce the time of development process. We will continue using Phalcon in our new projects. Thank you for the great work you are doing!",
    "testimonials_3": "Phalcon Team, The framework you guys have created is amazing. I've never used a framework that has combined speed, efficiency, brevity, and naturality all in one package. I intend on championing and contributing back to the project in any way that I can. I embarked recently on an ~800 hour project and am happy to say that we are using Phalcon Framework. Bravo.",
    "testimonials_4": "Hi guys, I just ran across Phalcon and it's just awesome! I've merely wanted to say to you how awesome you are! So, thanks for this framework and keep up the good work!",
    "testimonials_5": "Hi Guys, i wrote simple url-shortener service with phalcon. That was amazing! really. <a href=':1:'>:2:</a>. Demo is here: <a href=':3:'>:4:</a>)",
    "testimonials_6": "Hello Phalcon Team, I created a small project designed for Polish users using your framework. I have to admit that the performance is amazing, congratulations good job. Service to validate the content of the web pages in Polish language <a href=':1:'>:2:</a>",
    "testimonials_7": "Hi guys! Just wanted to share with you the latest release of our old project - <a href=':1:'>:2: </a>. Switching to phalcon allowed us to halve the server load compared to the previous framework, which is great!",
    "testimonials_description": "아래의 내용은 Phalcon PHP의 사용자와 개발자들, 그리고 당신으로 부터 받은 평가와 성공사례입니다. 성공사례에 관한 이메일은 언제나 환영하며, 블로그에 업로드하겠습니다. 성공사례를 보내고자 하시거나 연락을 원하신다면 <a href='mailto: :1:'>:2:</a> 주소로 언제든 메일 주세요.",
    "toggle_navigation": "네비게이션 토글",
    "transactions": "트랜잭션",
    "transactions_1": "하나의 프로세스가 여러 데이터베이스 작업을 실행하는 경우, 각 단계가 성공적으로 완료되어 데이터 무결성을 지키는것이 중요할 것입니다. 트랜잭션은 모든 데이터베이스 작업이 커밋되기 전에 성공적으로 실행되었음을 보장하는 기능을 합니다.",
    "transactions_2": "트랜잭션 관리자 생성",
    "transactions_3": "트랜잭션 요청",
    "transactions_4": "로봇을 삭제해봅니다",
    "transactions_5": "Something is wrong - rollback transaction",
    "transactions_6": "Everything is OK - commit transaction",
    "transactions_7": "로봇을 성공적으로 삭제했습니다!",
    "transactions_8": "실패했습니다, 원인: ",
    "transactions_description": "팔콘의 트랜잭션은 데이터 무결성을 안전하게 지킵니다.",
    "try_phalcon": "Phalcon 사용해보기",
    "tutorial": "튜토리얼",
    "views_and_frontend": "View & 프론트엔드",
    "watch_demo": "Watch the demo video"
}
